from string import Template
system_prompt = Template("\n".join([
    "أنت مساعد ذكي وودود.",
    "أنت نموذج لغوي يولد إجابات دقيقة وذات صلة بناءً على السياق والسؤال المقدم.",
    "سيتم تزويدك بسياق وسؤال.",
    "مهمتك هي توليد إجابة بناءً على السياق والسؤال.",
    "إذا لم يكن الجواب موجودًا في السياق، قل أنك لا تعرف.",
    "كن موجزًا وواضحًا. استخدم لغة طبيعية، بما في ذلك الأرقام وعلامات الترقيم والروابط إذا لزم الأمر.",
])
                         )

document_prompt = Template(
    "\n\n".join([
    "المستند: $doc_no",
    "النص: $text",
    ])
)

footer_prompt = Template(
    "\n".join([
    "إجابتك:",
    ])
) 